import type { RegisterDeckType } from "..";
import csr from "./csr";

export function cryoDecks(registerDeck: RegisterDeckType) {
  return {
    ...csr(registerDeck),

    "重优雷-企鹅带带北极熊": registerDeck({
      team: ["优菈", "雷电将军", "申鹤"],
      actions: {
        "狼的末路": 1,
        "赌徒的耳环": 2,
        "桓纳兰那": 2,
        "提米": 2,
        "立本": 2,
        "元素共鸣：交织之冰": 2,
        "元素共鸣：粉碎之冰": 2,
        "最好的伙伴！": 2,
        "换班时间": 2,
        "运筹帷幄": 2,
        "本大爷还没有输！": 2,
        "交给我吧！": 2,
        "星天之兆": 1,
        "重攻击": 1,
        "仙跳墙": 1,
        "莲花酥": 2,
        "蒙德土豆饼": 2,
      },
    }),

    "重申砂-啊乔巴": registerDeck({
      team: ["申鹤", "重云", "砂糖"],
      actions: {
        "混元熵增论": 2,
        "赌徒的耳环": 2,
        "凯瑟琳": 2,
        "立本": 1,
        "刘苏": 2,
        "寻宝仙灵": 2,
        "元素共鸣：交织之冰": 2,
        "元素共鸣：粉碎之冰": 2,
        "岩与契约": 2,
        "最好的伙伴！": 2,
        "换班时间": 2,
        "本大爷还没有输！": 2,
        "交给我吧！": 2,
        "快快缝补术": 2,
        "送你一程": 1,
        "莲花酥": 2,
      },
    }),
  };
}
