import type { RegisterDeckType } from "..";

export function electroDecks(registerDeck: RegisterDeckType) {
  return {
    "水皇赛-齿轮": registerDeck({
      team: ["纯水精灵·洛蒂娅", "菲谢尔", "赛诺"],
      actions: {
        "幸运儿银冠": 1,
        "璃月港口": 2,
        "派蒙": 2,
        "提米": 2,
        "立本": 2,
        "元素共鸣：交织之雷": 2,
        "元素共鸣：强能之雷": 2,
        "最好的伙伴！": 2,
        "换班时间": 2,
        "本大爷还没有输！": 2,
        "交给我吧！": 2,
        "白垩之术": 1,
        "送你一程": 2,
        "仙跳墙": 2,
        "莲花酥": 1,
        "蒙德土豆饼": 2,
        "烤蘑菇披萨": 1,
      },
    }),
    "雷泽重云雷神-长安大魔王": registerDeck({
      team: ["雷电将军", "重云", "雷泽"],
      actions: {
        "吐纳真定": 2,
        "赌徒的耳环": 2,
        "桓纳兰那": 2,
        "提米": 2,
        "立本": 2,
        "元素共鸣：交织之雷": 2,
        "元素共鸣：强能之雷": 2,
        "最好的伙伴！": 2,
        "运筹帷幄": 2,
        "本大爷还没有输！": 2,
        "交给我吧！": 2,
        "星天之兆": 1,
        "送你一程": 2,
        "莲花酥": 2,
        "蒙德土豆饼": 2,
        "兽肉薄荷卷": 1,
      },
    }),
  };
}
