import { registerDeck } from "../deck-store";

const elementCards = {
  "元素共鸣：交织之冰": 2,
  "元素共鸣：粉碎之冰": 2,
} as const;

const cryoDecks = {
  // 1：岩与契约 重攻击 仙跳墙 莲花酥
  "雷申重-毕游侠": registerDeck({
    team: ["申鹤", "雷电将军", "重云"],
    actions: {
      "赌徒的耳环": 2,
      "桓纳兰那": 2,
      "派蒙": 2,
      "提米": 2,
      "立本": 2,
      "刘苏": 2,
      "寻宝仙灵": 2,
      ...elementCards,
      "岩与契约": 1,
      "最好的伙伴！": 2,
      "本大爷还没有输！": 2,
      "送你一程": 2,
      "重攻击": 1,
      "仙跳墙": 1,
      "莲花酥": 1,
      "蒙德土豆饼": 2,
    },
  }),
  // 1：星天之兆 送你一程 重攻击 仙跳墙
  "雷申重-音尘": registerDeck({
    team: ["雷电将军", "申鹤", "重云"],
    actions: {
      "赌徒的耳环": 2,
      "璃月港口": 2,
      "桓纳兰那": 2,
      "提米": 2,
      "立本": 2,
      ...elementCards,
      "岩与契约": 2,
      "最好的伙伴！": 2,
      "本大爷还没有输！": 2,
      "交给我吧！": 2,
      "星天之兆": 1,
      "送你一程": 1,
      "重攻击": 1,
      "仙跳墙": 1,
      "莲花酥": 2,
      "蒙德土豆饼": 2,
    },
  }),

  "雷申重-Sherry": registerDeck({
    team: ["重云", "雷电将军", "申鹤"],
    actions: {
      "赌徒的耳环": 2,
      "桓纳兰那": 2,
      "提米": 2,
      "立本": 2,
      ...elementCards,
      "岩与契约": 1,
      "最好的伙伴！": 2,
      "运筹帷幄": 2,
      "本大爷还没有输！": 2,
      "交给我吧！": 2,
      "星天之兆": 1,
      "送你一程": 2,
      "仙跳墙": 2,
      "莲花酥": 2,
      "蒙德土豆饼": 2,
    },
  }),

  "雷申优-企鹅带带北极熊": registerDeck({
    team: ["优菈", "雷电将军", "申鹤"],
    actions: {
      "狼的末路": 1,
      "赌徒的耳环": 2,
      "桓纳兰那": 2,
      "提米": 2,
      "立本": 2,
      ...elementCards,
      "最好的伙伴！": 2,
      "换班时间": 2,
      "运筹帷幄": 2,
      "本大爷还没有输！": 2,
      "交给我吧！": 2,
      "星天之兆": 1,
      "重攻击": 1,
      "仙跳墙": 1,
      "莲花酥": 2,
      "蒙德土豆饼": 2,
    },
  }),
};

export default cryoDecks;
